#+TITLE: Week 03 Workbook
#+AUTHOR: Bryan Muller
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty inlineimages

** Exercise 3.6: Lexicographic Order

#+begin_src python :results output
  from itertools import product

  def lexlt(s, t):
      if (s==""):
          return True
      if (t==""):
          return False
      if (s[0] < t[0]):
          return True

      return (s[0] == t[0]) & lexlt(s[1::], t[1::])

  L1 = {"abacus", "bandana", "pig", "cat", "dodo", "zulu", "physics"}
  L2 = {"dog", "zebra", "zzxyz", "pimento"}

  def list_pairs(L1, L2):
      prod = list(product(L1, L2))
      filtered_pairs = set(filter(lambda s: lexlt(s[0], s[1]), prod))
      for i in filtered_pairs:
          print(i)

  list_pairs(L1, L2)
#+end_src

#+RESULTS:
#+begin_example
('dodo', 'dog')
('abacus', 'pimento')
('abacus', 'zebra')
('abacus', 'zzxyz')
('physics', 'zzxyz')
('pig', 'pimento')
('cat', 'zzxyz')
('dodo', 'zzxyz')
('abacus', 'dog')
('dodo', 'pimento')
('physics', 'zebra')
('zulu', 'zzxyz')
('cat', 'dog')
('dodo', 'zebra')
('cat', 'zebra')
('bandana', 'zzxyz')
('bandana', 'dog')
('cat', 'pimento')
('bandana', 'pimento')
('physics', 'pimento')
('pig', 'zzxyz')
('bandana', 'zebra')
('pig', 'zebra')
#+end_example


